/* */

/* 
  Разбить предложение
Напишите функцию, которая берет массив слов, объединяет их в предложение и возвращает предложение. 
Вы можете игнорировать необходимость очистки слов или добавления знаков препинания, но вы должны добавлять пробелы между каждым словом. Будьте внимательны, 
не должно быть пробела ни в начале, ни в конце предложения!

['hello', 'world', 'this', 'is', 'great']  =>  'hello world this is great'
*/

// {
//   static string Smash(string[] words)
//   {
//     string str = "";
//     // Smash words
//     for (int i = 0; i < words.Length; i++)
//     {
//        if()
//     }
//     return null;
//   }
// }

// string[] arr = {"hello", "world", "this", "is", "great"};


